#![allow(warnings)]
/* automatically generated by rust-bindgen 0.57.0 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {

pub const TYPE_ATTRIBUTE_NESTED_PUBLIC: u32 = 2;
pub const TYPE_ATTRIBUTE_NESTED_PRIVATE: u32 = 3;
pub const TYPE_ATTRIBUTE_NESTED_FAMILY: u32 = 4;
pub const TYPE_ATTRIBUTE_NESTED_ASSEMBLY: u32 = 5;
pub const TYPE_ATTRIBUTE_NESTED_FAM_AND_ASSEM: u32 = 6;
pub const TYPE_ATTRIBUTE_NESTED_FAM_OR_ASSEM: u32 = 7;
pub const TYPE_ATTRIBUTE_LAYOUT_MASK: u32 = 24;
pub const TYPE_ATTRIBUTE_AUTO_LAYOUT: u32 = 0;
pub const TYPE_ATTRIBUTE_SEQUENTIAL_LAYOUT: u32 = 8;
pub const TYPE_ATTRIBUTE_EXPLICIT_LAYOUT: u32 = 16;
pub const TYPE_ATTRIBUTE_CLASS_SEMANTIC_MASK: u32 = 32;
pub const TYPE_ATTRIBUTE_CLASS: u32 = 0;
pub const TYPE_ATTRIBUTE_INTERFACE: u32 = 32;
pub const TYPE_ATTRIBUTE_ABSTRACT: u32 = 128;
pub const TYPE_ATTRIBUTE_SEALED: u32 = 256;
pub const TYPE_ATTRIBUTE_SPECIAL_NAME: u32 = 1024;
pub const TYPE_ATTRIBUTE_IMPORT: u32 = 4096;
pub const TYPE_ATTRIBUTE_SERIALIZABLE: u32 = 8192;
pub const TYPE_ATTRIBUTE_STRING_FORMAT_MASK: u32 = 196608;
pub const TYPE_ATTRIBUTE_ANSI_CLASS: u32 = 0;
pub const TYPE_ATTRIBUTE_UNICODE_CLASS: u32 = 65536;
pub const TYPE_ATTRIBUTE_AUTO_CLASS: u32 = 131072;
pub const TYPE_ATTRIBUTE_BEFORE_FIELD_INIT: u32 = 1048576;
pub const TYPE_ATTRIBUTE_FORWARDER: u32 = 2097152;
pub const TYPE_ATTRIBUTE_RESERVED_MASK: u32 = 264192;
pub const TYPE_ATTRIBUTE_RT_SPECIAL_NAME: u32 = 2048;
pub const TYPE_ATTRIBUTE_HAS_SECURITY: u32 = 262144;
pub const PARAM_ATTRIBUTE_IN: u32 = 1;
pub const PARAM_ATTRIBUTE_OUT: u32 = 2;
pub const PARAM_ATTRIBUTE_OPTIONAL: u32 = 16;
pub const PARAM_ATTRIBUTE_RESERVED_MASK: u32 = 61440;
pub const PARAM_ATTRIBUTE_HAS_DEFAULT: u32 = 4096;
pub const PARAM_ATTRIBUTE_HAS_FIELD_MARSHAL: u32 = 8192;
pub const PARAM_ATTRIBUTE_UNUSED: u32 = 53216;
pub const IL2CPP_GENERIC_PARAMETER_ATTRIBUTE_NON_VARIANT: u32 = 0;
pub const IL2CPP_GENERIC_PARAMETER_ATTRIBUTE_COVARIANT: u32 = 1;
pub const IL2CPP_GENERIC_PARAMETER_ATTRIBUTE_CONTRAVARIANT: u32 = 2;
pub const IL2CPP_GENERIC_PARAMETER_ATTRIBUTE_VARIANCE_MASK: u32 = 3;
pub const IL2CPP_GENERIC_PARAMETER_ATTRIBUTE_REFERENCE_TYPE_CONSTRAINT: u32 = 4;
pub const IL2CPP_GENERIC_PARAMETER_ATTRIBUTE_NOT_NULLABLE_VALUE_TYPE_CONSTRAINT: u32 = 8;
pub const IL2CPP_GENERIC_PARAMETER_ATTRIBUTE_DEFAULT_CONSTRUCTOR_CONSTRAINT: u32 = 16;
pub const IL2CPP_GENERIC_PARAMETER_ATTRIBUTE_SPECIAL_CONSTRAINT_MASK: u32 = 28;
pub const ASSEMBLYREF_FULL_PUBLIC_KEY_FLAG: u32 = 1;
pub const ASSEMBLYREF_RETARGETABLE_FLAG: u32 = 256;
pub const ASSEMBLYREF_ENABLEJITCOMPILE_TRACKING_FLAG: u32 = 32768;
pub const ASSEMBLYREF_DISABLEJITCOMPILE_OPTIMIZER_FLAG: u32 = 16384;
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type ssize_t = __ssize_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__once_flag>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).fptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).state as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_type as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_deg as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_sep as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).end_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__old_x as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__c as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__init as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__a as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppProfiler {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppManagedMemorySnapshot {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppCustomAttrInfo {
    _unused: [u8; 0],
}
pub const Il2CppProfileFlags_IL2CPP_PROFILE_NONE: Il2CppProfileFlags = 0;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_APPDOMAIN_EVENTS: Il2CppProfileFlags = 1;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_ASSEMBLY_EVENTS: Il2CppProfileFlags = 2;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_MODULE_EVENTS: Il2CppProfileFlags = 4;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_CLASS_EVENTS: Il2CppProfileFlags = 8;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_JIT_COMPILATION: Il2CppProfileFlags = 16;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_INLINING: Il2CppProfileFlags = 32;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_EXCEPTIONS: Il2CppProfileFlags = 64;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_ALLOCATIONS: Il2CppProfileFlags = 128;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_GC: Il2CppProfileFlags = 256;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_THREADS: Il2CppProfileFlags = 512;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_REMOTING: Il2CppProfileFlags = 1024;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_TRANSITIONS: Il2CppProfileFlags = 2048;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_ENTER_LEAVE: Il2CppProfileFlags = 4096;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_COVERAGE: Il2CppProfileFlags = 8192;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_INS_COVERAGE: Il2CppProfileFlags = 16384;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_STATISTICAL: Il2CppProfileFlags = 32768;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_METHOD_EVENTS: Il2CppProfileFlags = 65536;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_MONITOR_EVENTS: Il2CppProfileFlags = 131072;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_IOMAP_EVENTS: Il2CppProfileFlags = 262144;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_GC_MOVES: Il2CppProfileFlags = 524288;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_FILEIO: Il2CppProfileFlags = 1048576;
pub type Il2CppProfileFlags = ::std::os::raw::c_uint;
pub const Il2CppProfileFileIOKind_IL2CPP_PROFILE_FILEIO_WRITE: Il2CppProfileFileIOKind = 0;
pub const Il2CppProfileFileIOKind_IL2CPP_PROFILE_FILEIO_READ: Il2CppProfileFileIOKind = 1;
pub type Il2CppProfileFileIOKind = ::std::os::raw::c_uint;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_START: Il2CppGCEvent = 0;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_MARK_START: Il2CppGCEvent = 1;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_MARK_END: Il2CppGCEvent = 2;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_RECLAIM_START: Il2CppGCEvent = 3;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_RECLAIM_END: Il2CppGCEvent = 4;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_END: Il2CppGCEvent = 5;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_PRE_STOP_WORLD: Il2CppGCEvent = 6;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_POST_STOP_WORLD: Il2CppGCEvent = 7;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_PRE_START_WORLD: Il2CppGCEvent = 8;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_POST_START_WORLD: Il2CppGCEvent = 9;
pub type Il2CppGCEvent = ::std::os::raw::c_uint;
pub const Il2CppStat_IL2CPP_STAT_NEW_OBJECT_COUNT: Il2CppStat = 0;
pub const Il2CppStat_IL2CPP_STAT_INITIALIZED_CLASS_COUNT: Il2CppStat = 1;
pub const Il2CppStat_IL2CPP_STAT_METHOD_COUNT: Il2CppStat = 2;
pub const Il2CppStat_IL2CPP_STAT_CLASS_STATIC_DATA_SIZE: Il2CppStat = 3;
pub const Il2CppStat_IL2CPP_STAT_GENERIC_INSTANCE_COUNT: Il2CppStat = 4;
pub const Il2CppStat_IL2CPP_STAT_GENERIC_CLASS_COUNT: Il2CppStat = 5;
pub const Il2CppStat_IL2CPP_STAT_INFLATED_METHOD_COUNT: Il2CppStat = 6;
pub const Il2CppStat_IL2CPP_STAT_INFLATED_TYPE_COUNT: Il2CppStat = 7;
pub type Il2CppStat = ::std::os::raw::c_uint;
pub const Il2CppRuntimeUnhandledExceptionPolicy_IL2CPP_UNHANDLED_POLICY_LEGACY:
    Il2CppRuntimeUnhandledExceptionPolicy = 0;
pub const Il2CppRuntimeUnhandledExceptionPolicy_IL2CPP_UNHANDLED_POLICY_CURRENT:
    Il2CppRuntimeUnhandledExceptionPolicy = 1;
pub type Il2CppRuntimeUnhandledExceptionPolicy = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppStackFrameInfo {
    pub method: *const MethodInfo,
}
#[test]
fn bindgen_test_layout_Il2CppStackFrameInfo() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppStackFrameInfo>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppStackFrameInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppStackFrameInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppStackFrameInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStackFrameInfo>())).method as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStackFrameInfo),
            "::",
            stringify!(method)
        )
    );
}
pub type Il2CppMethodPointer = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodDebugInfo {
    pub methodPointer: Il2CppMethodPointer,
    pub code_size: i32,
    pub file: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_Il2CppMethodDebugInfo() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodDebugInfo>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppMethodDebugInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodDebugInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppMethodDebugInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodDebugInfo>())).methodPointer as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDebugInfo),
            "::",
            stringify!(methodPointer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppMethodDebugInfo>())).code_size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDebugInfo),
            "::",
            stringify!(code_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppMethodDebugInfo>())).file as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDebugInfo),
            "::",
            stringify!(file)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMemoryCallbacks {
    pub malloc_func:
        ::std::option::Option<unsafe extern "C" fn(size: size_t) -> *mut ::std::os::raw::c_void>,
    pub aligned_malloc_func: ::std::option::Option<
        unsafe extern "C" fn(size: size_t, alignment: size_t) -> *mut ::std::os::raw::c_void,
    >,
    pub free_func: ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void)>,
    pub aligned_free_func:
        ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void)>,
    pub calloc_func: ::std::option::Option<
        unsafe extern "C" fn(nmemb: size_t, size: size_t) -> *mut ::std::os::raw::c_void,
    >,
    pub realloc_func: ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::os::raw::c_void,
            size: size_t,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub aligned_realloc_func: ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::os::raw::c_void,
            size: size_t,
            alignment: size_t,
        ) -> *mut ::std::os::raw::c_void,
    >,
}
#[test]
fn bindgen_test_layout_Il2CppMemoryCallbacks() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppMemoryCallbacks>(),
        56usize,
        concat!("Size of: ", stringify!(Il2CppMemoryCallbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMemoryCallbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppMemoryCallbacks))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMemoryCallbacks>())).malloc_func as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(malloc_func)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMemoryCallbacks>())).aligned_malloc_func as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(aligned_malloc_func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppMemoryCallbacks>())).free_func as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(free_func)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMemoryCallbacks>())).aligned_free_func as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(aligned_free_func)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMemoryCallbacks>())).calloc_func as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(calloc_func)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMemoryCallbacks>())).realloc_func as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(realloc_func)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMemoryCallbacks>())).aligned_realloc_func as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(aligned_realloc_func)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppDebuggerTransport {
    pub name: *const ::std::os::raw::c_char,
    pub connect:
        ::std::option::Option<unsafe extern "C" fn(address: *const ::std::os::raw::c_char)>,
    pub wait_for_attach: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub close1: ::std::option::Option<unsafe extern "C" fn()>,
    pub close2: ::std::option::Option<unsafe extern "C" fn()>,
    pub send: ::std::option::Option<
        unsafe extern "C" fn(
            buf: *mut ::std::os::raw::c_void,
            len: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub recv: ::std::option::Option<
        unsafe extern "C" fn(
            buf: *mut ::std::os::raw::c_void,
            len: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_Il2CppDebuggerTransport() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppDebuggerTransport>(),
        56usize,
        concat!("Size of: ", stringify!(Il2CppDebuggerTransport))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppDebuggerTransport>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppDebuggerTransport))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDebuggerTransport>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDebuggerTransport>())).connect as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(connect)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDebuggerTransport>())).wait_for_attach as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(wait_for_attach)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDebuggerTransport>())).close1 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(close1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDebuggerTransport>())).close2 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(close2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDebuggerTransport>())).send as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(send)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDebuggerTransport>())).recv as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(recv)
        )
    );
}
pub type Il2CppChar = u16;
pub type Il2CppNativeChar = ::std::os::raw::c_char;
pub type il2cpp_register_object_callback = ::std::option::Option<
    unsafe extern "C" fn(
        arr: *mut *mut Il2CppObject,
        size: ::std::os::raw::c_int,
        userdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type il2cpp_WorldChangedCallback = ::std::option::Option<unsafe extern "C" fn()>;
pub type Il2CppFrameWalkFunc = ::std::option::Option<
    unsafe extern "C" fn(info: *const Il2CppStackFrameInfo, user_data: *mut ::std::os::raw::c_void),
>;
pub type Il2CppProfileFunc = ::std::option::Option<unsafe extern "C" fn(prof: *mut Il2CppProfiler)>;
pub type Il2CppProfileMethodFunc = ::std::option::Option<
    unsafe extern "C" fn(prof: *mut Il2CppProfiler, method: *const MethodInfo),
>;
pub type Il2CppProfileAllocFunc = ::std::option::Option<
    unsafe extern "C" fn(
        prof: *mut Il2CppProfiler,
        obj: *mut Il2CppObject,
        klass: *mut Il2CppClass,
    ),
>;
pub type Il2CppProfileGCFunc = ::std::option::Option<
    unsafe extern "C" fn(
        prof: *mut Il2CppProfiler,
        event: Il2CppGCEvent,
        generation: ::std::os::raw::c_int,
    ),
>;
pub type Il2CppProfileGCResizeFunc =
    ::std::option::Option<unsafe extern "C" fn(prof: *mut Il2CppProfiler, new_size: i64)>;
pub type Il2CppProfileFileIOFunc = ::std::option::Option<
    unsafe extern "C" fn(
        prof: *mut Il2CppProfiler,
        kind: Il2CppProfileFileIOKind,
        count: ::std::os::raw::c_int,
    ),
>;
pub type Il2CppProfileThreadFunc = ::std::option::Option<
    unsafe extern "C" fn(prof: *mut Il2CppProfiler, tid: ::std::os::raw::c_ulong),
>;
pub type Il2CppSetFindPlugInCallback = ::std::option::Option<
    unsafe extern "C" fn(arg1: *const Il2CppNativeChar) -> *const Il2CppNativeChar,
>;
pub type Il2CppLogCallback =
    ::std::option::Option<unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char)>;
pub type Il2CppBacktraceFunc = ::std::option::Option<
    unsafe extern "C" fn(buffer: *mut Il2CppMethodPointer, maxSize: size_t) -> size_t,
>;
pub type il2cpp_array_size_t = usize;
pub type SynchronizationContextCallback = ::std::option::Option<unsafe extern "C" fn(arg: isize)>;
pub type Il2CppMethodSlot = u32;
pub const kInvalidIl2CppMethodSlot: u32 = 65535;
pub const kIl2CppInt32Min: i32 = -2147483648;
pub const kIl2CppInt32Max: i32 = 2147483647;
pub const kIl2CppUInt32Max: u32 = 4294967295;
pub const kIl2CppInt64Min: i64 = -9223372036854775808;
pub const kIl2CppInt64Max: i64 = 9223372036854775807;
extern "C" {
    pub static kIl2CppUInt64Max: u64;
}
extern "C" {
    pub static kIl2CppUIntPtrMax: usize;
}
pub const ipv6AddressSize: ::std::os::raw::c_int = 16;
pub type il2cpp_hresult_t = i32;
extern "C" {
    pub static kIl2CppNewLine: [Il2CppChar; 2usize];
}
pub const Il2CppTypeEnum_IL2CPP_TYPE_END: Il2CppTypeEnum = 0;
pub const Il2CppTypeEnum_IL2CPP_TYPE_VOID: Il2CppTypeEnum = 1;
pub const Il2CppTypeEnum_IL2CPP_TYPE_BOOLEAN: Il2CppTypeEnum = 2;
pub const Il2CppTypeEnum_IL2CPP_TYPE_CHAR: Il2CppTypeEnum = 3;
pub const Il2CppTypeEnum_IL2CPP_TYPE_I1: Il2CppTypeEnum = 4;
pub const Il2CppTypeEnum_IL2CPP_TYPE_U1: Il2CppTypeEnum = 5;
pub const Il2CppTypeEnum_IL2CPP_TYPE_I2: Il2CppTypeEnum = 6;
pub const Il2CppTypeEnum_IL2CPP_TYPE_U2: Il2CppTypeEnum = 7;
pub const Il2CppTypeEnum_IL2CPP_TYPE_I4: Il2CppTypeEnum = 8;
pub const Il2CppTypeEnum_IL2CPP_TYPE_U4: Il2CppTypeEnum = 9;
pub const Il2CppTypeEnum_IL2CPP_TYPE_I8: Il2CppTypeEnum = 10;
pub const Il2CppTypeEnum_IL2CPP_TYPE_U8: Il2CppTypeEnum = 11;
pub const Il2CppTypeEnum_IL2CPP_TYPE_R4: Il2CppTypeEnum = 12;
pub const Il2CppTypeEnum_IL2CPP_TYPE_R8: Il2CppTypeEnum = 13;
pub const Il2CppTypeEnum_IL2CPP_TYPE_STRING: Il2CppTypeEnum = 14;
pub const Il2CppTypeEnum_IL2CPP_TYPE_PTR: Il2CppTypeEnum = 15;
pub const Il2CppTypeEnum_IL2CPP_TYPE_BYREF: Il2CppTypeEnum = 16;
pub const Il2CppTypeEnum_IL2CPP_TYPE_VALUETYPE: Il2CppTypeEnum = 17;
pub const Il2CppTypeEnum_IL2CPP_TYPE_CLASS: Il2CppTypeEnum = 18;
pub const Il2CppTypeEnum_IL2CPP_TYPE_VAR: Il2CppTypeEnum = 19;
pub const Il2CppTypeEnum_IL2CPP_TYPE_ARRAY: Il2CppTypeEnum = 20;
pub const Il2CppTypeEnum_IL2CPP_TYPE_GENERICINST: Il2CppTypeEnum = 21;
pub const Il2CppTypeEnum_IL2CPP_TYPE_TYPEDBYREF: Il2CppTypeEnum = 22;
pub const Il2CppTypeEnum_IL2CPP_TYPE_I: Il2CppTypeEnum = 24;
pub const Il2CppTypeEnum_IL2CPP_TYPE_U: Il2CppTypeEnum = 25;
pub const Il2CppTypeEnum_IL2CPP_TYPE_FNPTR: Il2CppTypeEnum = 27;
pub const Il2CppTypeEnum_IL2CPP_TYPE_OBJECT: Il2CppTypeEnum = 28;
pub const Il2CppTypeEnum_IL2CPP_TYPE_SZARRAY: Il2CppTypeEnum = 29;
pub const Il2CppTypeEnum_IL2CPP_TYPE_MVAR: Il2CppTypeEnum = 30;
pub const Il2CppTypeEnum_IL2CPP_TYPE_CMOD_REQD: Il2CppTypeEnum = 31;
pub const Il2CppTypeEnum_IL2CPP_TYPE_CMOD_OPT: Il2CppTypeEnum = 32;
pub const Il2CppTypeEnum_IL2CPP_TYPE_INTERNAL: Il2CppTypeEnum = 33;
pub const Il2CppTypeEnum_IL2CPP_TYPE_MODIFIER: Il2CppTypeEnum = 64;
pub const Il2CppTypeEnum_IL2CPP_TYPE_SENTINEL: Il2CppTypeEnum = 65;
pub const Il2CppTypeEnum_IL2CPP_TYPE_PINNED: Il2CppTypeEnum = 69;
pub const Il2CppTypeEnum_IL2CPP_TYPE_ENUM: Il2CppTypeEnum = 85;
pub type Il2CppTypeEnum = ::std::os::raw::c_uint;
pub const Il2CppTokenType_IL2CPP_TOKEN_MODULE: Il2CppTokenType = 0;
pub const Il2CppTokenType_IL2CPP_TOKEN_TYPE_REF: Il2CppTokenType = 16777216;
pub const Il2CppTokenType_IL2CPP_TOKEN_TYPE_DEF: Il2CppTokenType = 33554432;
pub const Il2CppTokenType_IL2CPP_TOKEN_FIELD_DEF: Il2CppTokenType = 67108864;
pub const Il2CppTokenType_IL2CPP_TOKEN_METHOD_DEF: Il2CppTokenType = 100663296;
pub const Il2CppTokenType_IL2CPP_TOKEN_PARAM_DEF: Il2CppTokenType = 134217728;
pub const Il2CppTokenType_IL2CPP_TOKEN_INTERFACE_IMPL: Il2CppTokenType = 150994944;
pub const Il2CppTokenType_IL2CPP_TOKEN_MEMBER_REF: Il2CppTokenType = 167772160;
pub const Il2CppTokenType_IL2CPP_TOKEN_CUSTOM_ATTRIBUTE: Il2CppTokenType = 201326592;
pub const Il2CppTokenType_IL2CPP_TOKEN_PERMISSION: Il2CppTokenType = 234881024;
pub const Il2CppTokenType_IL2CPP_TOKEN_SIGNATURE: Il2CppTokenType = 285212672;
pub const Il2CppTokenType_IL2CPP_TOKEN_EVENT: Il2CppTokenType = 335544320;
pub const Il2CppTokenType_IL2CPP_TOKEN_PROPERTY: Il2CppTokenType = 385875968;
pub const Il2CppTokenType_IL2CPP_TOKEN_MODULE_REF: Il2CppTokenType = 436207616;
pub const Il2CppTokenType_IL2CPP_TOKEN_TYPE_SPEC: Il2CppTokenType = 452984832;
pub const Il2CppTokenType_IL2CPP_TOKEN_ASSEMBLY: Il2CppTokenType = 536870912;
pub const Il2CppTokenType_IL2CPP_TOKEN_ASSEMBLY_REF: Il2CppTokenType = 587202560;
pub const Il2CppTokenType_IL2CPP_TOKEN_FILE: Il2CppTokenType = 637534208;
pub const Il2CppTokenType_IL2CPP_TOKEN_EXPORTED_TYPE: Il2CppTokenType = 654311424;
pub const Il2CppTokenType_IL2CPP_TOKEN_MANIFEST_RESOURCE: Il2CppTokenType = 671088640;
pub const Il2CppTokenType_IL2CPP_TOKEN_GENERIC_PARAM: Il2CppTokenType = 704643072;
pub const Il2CppTokenType_IL2CPP_TOKEN_METHOD_SPEC: Il2CppTokenType = 721420288;
pub type Il2CppTokenType = ::std::os::raw::c_uint;
pub type TypeIndex = i32;
pub type TypeDefinitionIndex = i32;
pub type FieldIndex = i32;
pub type DefaultValueIndex = i32;
pub type DefaultValueDataIndex = i32;
pub type CustomAttributeIndex = i32;
pub type ParameterIndex = i32;
pub type MethodIndex = i32;
pub type GenericMethodIndex = i32;
pub type PropertyIndex = i32;
pub type EventIndex = i32;
pub type GenericContainerIndex = i32;
pub type GenericParameterIndex = i32;
pub type GenericParameterConstraintIndex = i16;
pub type NestedTypeIndex = i32;
pub type InterfacesIndex = i32;
pub type VTableIndex = i32;
pub type InterfaceOffsetIndex = i32;
pub type RGCTXIndex = i32;
pub type StringIndex = i32;
pub type StringLiteralIndex = i32;
pub type GenericInstIndex = i32;
pub type ImageIndex = i32;
pub type AssemblyIndex = i32;
pub type InteropDataIndex = i32;
pub const kTypeIndexInvalid: TypeIndex = -1;
pub const kTypeDefinitionIndexInvalid: TypeDefinitionIndex = -1;
pub const kDefaultValueIndexNull: DefaultValueDataIndex = -1;
pub const kCustomAttributeIndexInvalid: CustomAttributeIndex = -1;
pub const kEventIndexInvalid: EventIndex = -1;
pub const kFieldIndexInvalid: FieldIndex = -1;
pub const kMethodIndexInvalid: MethodIndex = -1;
pub const kPropertyIndexInvalid: PropertyIndex = -1;
pub const kGenericContainerIndexInvalid: GenericContainerIndex = -1;
pub const kGenericParameterIndexInvalid: GenericParameterIndex = -1;
pub const kRGCTXIndexInvalid: RGCTXIndex = -1;
pub const kStringLiteralIndexInvalid: StringLiteralIndex = -1;
pub const kInteropDataIndexInvalid: InteropDataIndex = -1;
pub type EncodedMethodIndex = u32;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageInvalid: Il2CppMetadataUsage = 0;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageTypeInfo: Il2CppMetadataUsage = 1;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageIl2CppType: Il2CppMetadataUsage = 2;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageMethodDef: Il2CppMetadataUsage = 3;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageFieldInfo: Il2CppMetadataUsage = 4;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageStringLiteral: Il2CppMetadataUsage = 5;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageMethodRef: Il2CppMetadataUsage = 6;
pub type Il2CppMetadataUsage = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppTypeDefinitionMetadata {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppRGCTXDefinitionData {
    pub rgctxDataDummy: i32,
    pub methodIndex: MethodIndex,
    pub typeIndex: TypeIndex,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_Il2CppRGCTXDefinitionData() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppRGCTXDefinitionData>(),
        4usize,
        concat!("Size of: ", stringify!(Il2CppRGCTXDefinitionData))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppRGCTXDefinitionData>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppRGCTXDefinitionData))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppRGCTXDefinitionData>())).rgctxDataDummy as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXDefinitionData),
            "::",
            stringify!(rgctxDataDummy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppRGCTXDefinitionData>())).methodIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXDefinitionData),
            "::",
            stringify!(methodIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppRGCTXDefinitionData>())).typeIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXDefinitionData),
            "::",
            stringify!(typeIndex)
        )
    );
}
pub const Il2CppRGCTXDataType_IL2CPP_RGCTX_DATA_INVALID: Il2CppRGCTXDataType = 0;
pub const Il2CppRGCTXDataType_IL2CPP_RGCTX_DATA_TYPE: Il2CppRGCTXDataType = 1;
pub const Il2CppRGCTXDataType_IL2CPP_RGCTX_DATA_CLASS: Il2CppRGCTXDataType = 2;
pub const Il2CppRGCTXDataType_IL2CPP_RGCTX_DATA_METHOD: Il2CppRGCTXDataType = 3;
pub const Il2CppRGCTXDataType_IL2CPP_RGCTX_DATA_ARRAY: Il2CppRGCTXDataType = 4;
pub type Il2CppRGCTXDataType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Il2CppRGCTXDefinition {
    pub type_: Il2CppRGCTXDataType,
    pub data: Il2CppRGCTXDefinitionData,
}
#[test]
fn bindgen_test_layout_Il2CppRGCTXDefinition() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppRGCTXDefinition>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppRGCTXDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppRGCTXDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppRGCTXDefinition))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppRGCTXDefinition>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXDefinition),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppRGCTXDefinition>())).data as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXDefinition),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppInterfaceOffsetPair {
    pub interfaceTypeIndex: TypeIndex,
    pub offset: i32,
}
#[test]
fn bindgen_test_layout_Il2CppInterfaceOffsetPair() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppInterfaceOffsetPair>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppInterfaceOffsetPair))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppInterfaceOffsetPair>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppInterfaceOffsetPair))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppInterfaceOffsetPair>())).interfaceTypeIndex as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInterfaceOffsetPair),
            "::",
            stringify!(interfaceTypeIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppInterfaceOffsetPair>())).offset as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInterfaceOffsetPair),
            "::",
            stringify!(offset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppTypeDefinition {
    pub nameIndex: StringIndex,
    pub namespaceIndex: StringIndex,
    pub byvalTypeIndex: TypeIndex,
    pub byrefTypeIndex: TypeIndex,
    pub declaringTypeIndex: TypeIndex,
    pub parentIndex: TypeIndex,
    pub elementTypeIndex: TypeIndex,
    pub genericContainerIndex: GenericContainerIndex,
    pub flags: u32,
    pub fieldStart: FieldIndex,
    pub methodStart: MethodIndex,
    pub eventStart: EventIndex,
    pub propertyStart: PropertyIndex,
    pub nestedTypesStart: NestedTypeIndex,
    pub interfacesStart: InterfacesIndex,
    pub vtableStart: VTableIndex,
    pub interfaceOffsetsStart: InterfacesIndex,
    pub method_count: u16,
    pub property_count: u16,
    pub field_count: u16,
    pub event_count: u16,
    pub nested_type_count: u16,
    pub vtable_count: u16,
    pub interfaces_count: u16,
    pub interface_offsets_count: u16,
    pub bitfield: u32,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_Il2CppTypeDefinition() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppTypeDefinition>(),
        92usize,
        concat!("Size of: ", stringify!(Il2CppTypeDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppTypeDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppTypeDefinition))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppTypeDefinition>())).nameIndex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).namespaceIndex as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(namespaceIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).byvalTypeIndex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(byvalTypeIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).byrefTypeIndex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(byrefTypeIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).declaringTypeIndex as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(declaringTypeIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).parentIndex as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(parentIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).elementTypeIndex as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(elementTypeIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).genericContainerIndex as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(genericContainerIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppTypeDefinition>())).flags as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppTypeDefinition>())).fieldStart as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(fieldStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).methodStart as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(methodStart)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppTypeDefinition>())).eventStart as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(eventStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).propertyStart as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(propertyStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).nestedTypesStart as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(nestedTypesStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).interfacesStart as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(interfacesStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).vtableStart as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(vtableStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).interfaceOffsetsStart as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(interfaceOffsetsStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).method_count as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(method_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).property_count as *const _ as usize
        },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(property_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).field_count as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(field_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).event_count as *const _ as usize
        },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(event_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).nested_type_count as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(nested_type_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).vtable_count as *const _ as usize
        },
        78usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(vtable_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).interfaces_count as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(interfaces_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppTypeDefinition>())).interface_offsets_count as *const _
                as usize
        },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(interface_offsets_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppTypeDefinition>())).bitfield as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(bitfield)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppTypeDefinition>())).token as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppFieldDefinition {
    pub nameIndex: StringIndex,
    pub typeIndex: TypeIndex,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_Il2CppFieldDefinition() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppFieldDefinition>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppFieldDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppFieldDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppFieldDefinition))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppFieldDefinition>())).nameIndex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppFieldDefinition>())).typeIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldDefinition),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppFieldDefinition>())).token as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldDefinition),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppFieldDefaultValue {
    pub fieldIndex: FieldIndex,
    pub typeIndex: TypeIndex,
    pub dataIndex: DefaultValueDataIndex,
}
#[test]
fn bindgen_test_layout_Il2CppFieldDefaultValue() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppFieldDefaultValue>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppFieldDefaultValue))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppFieldDefaultValue>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppFieldDefaultValue))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppFieldDefaultValue>())).fieldIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldDefaultValue),
            "::",
            stringify!(fieldIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppFieldDefaultValue>())).typeIndex as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldDefaultValue),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppFieldDefaultValue>())).dataIndex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldDefaultValue),
            "::",
            stringify!(dataIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppFieldMarshaledSize {
    pub fieldIndex: FieldIndex,
    pub typeIndex: TypeIndex,
    pub size: i32,
}
#[test]
fn bindgen_test_layout_Il2CppFieldMarshaledSize() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppFieldMarshaledSize>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppFieldMarshaledSize))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppFieldMarshaledSize>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppFieldMarshaledSize))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppFieldMarshaledSize>())).fieldIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldMarshaledSize),
            "::",
            stringify!(fieldIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppFieldMarshaledSize>())).typeIndex as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldMarshaledSize),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppFieldMarshaledSize>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldMarshaledSize),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppFieldRef {
    pub typeIndex: TypeIndex,
    pub fieldIndex: FieldIndex,
}
#[test]
fn bindgen_test_layout_Il2CppFieldRef() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppFieldRef>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppFieldRef))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppFieldRef>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppFieldRef))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppFieldRef>())).typeIndex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldRef),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppFieldRef>())).fieldIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldRef),
            "::",
            stringify!(fieldIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppParameterDefinition {
    pub nameIndex: StringIndex,
    pub token: u32,
    pub typeIndex: TypeIndex,
}
#[test]
fn bindgen_test_layout_Il2CppParameterDefinition() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppParameterDefinition>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppParameterDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppParameterDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppParameterDefinition))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppParameterDefinition>())).nameIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppParameterDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppParameterDefinition>())).token as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppParameterDefinition),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppParameterDefinition>())).typeIndex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppParameterDefinition),
            "::",
            stringify!(typeIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppParameterDefaultValue {
    pub parameterIndex: ParameterIndex,
    pub typeIndex: TypeIndex,
    pub dataIndex: DefaultValueDataIndex,
}
#[test]
fn bindgen_test_layout_Il2CppParameterDefaultValue() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppParameterDefaultValue>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppParameterDefaultValue))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppParameterDefaultValue>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppParameterDefaultValue))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppParameterDefaultValue>())).parameterIndex as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppParameterDefaultValue),
            "::",
            stringify!(parameterIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppParameterDefaultValue>())).typeIndex as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppParameterDefaultValue),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppParameterDefaultValue>())).dataIndex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppParameterDefaultValue),
            "::",
            stringify!(dataIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodDefinition {
    pub nameIndex: StringIndex,
    pub declaringType: TypeDefinitionIndex,
    pub returnType: TypeIndex,
    pub parameterStart: ParameterIndex,
    pub genericContainerIndex: GenericContainerIndex,
    pub token: u32,
    pub flags: u16,
    pub iflags: u16,
    pub slot: u16,
    pub parameterCount: u16,
}
#[test]
fn bindgen_test_layout_Il2CppMethodDefinition() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodDefinition>(),
        32usize,
        concat!("Size of: ", stringify!(Il2CppMethodDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppMethodDefinition))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodDefinition>())).nameIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodDefinition>())).declaringType as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(declaringType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodDefinition>())).returnType as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(returnType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodDefinition>())).parameterStart as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(parameterStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodDefinition>())).genericContainerIndex as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(genericContainerIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppMethodDefinition>())).token as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppMethodDefinition>())).flags as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppMethodDefinition>())).iflags as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(iflags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppMethodDefinition>())).slot as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodDefinition>())).parameterCount as *const _ as usize
        },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(parameterCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppEventDefinition {
    pub nameIndex: StringIndex,
    pub typeIndex: TypeIndex,
    pub add: MethodIndex,
    pub remove: MethodIndex,
    pub raise: MethodIndex,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_Il2CppEventDefinition() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppEventDefinition>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppEventDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppEventDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppEventDefinition))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppEventDefinition>())).nameIndex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppEventDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppEventDefinition>())).typeIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppEventDefinition),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppEventDefinition>())).add as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppEventDefinition),
            "::",
            stringify!(add)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppEventDefinition>())).remove as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppEventDefinition),
            "::",
            stringify!(remove)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppEventDefinition>())).raise as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppEventDefinition),
            "::",
            stringify!(raise)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppEventDefinition>())).token as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppEventDefinition),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppPropertyDefinition {
    pub nameIndex: StringIndex,
    pub get: MethodIndex,
    pub set: MethodIndex,
    pub attrs: u32,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_Il2CppPropertyDefinition() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppPropertyDefinition>(),
        20usize,
        concat!("Size of: ", stringify!(Il2CppPropertyDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppPropertyDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppPropertyDefinition))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppPropertyDefinition>())).nameIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppPropertyDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppPropertyDefinition>())).get as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppPropertyDefinition),
            "::",
            stringify!(get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppPropertyDefinition>())).set as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppPropertyDefinition),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppPropertyDefinition>())).attrs as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppPropertyDefinition),
            "::",
            stringify!(attrs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppPropertyDefinition>())).token as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppPropertyDefinition),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodSpec {
    pub methodDefinitionIndex: MethodIndex,
    pub classIndexIndex: GenericInstIndex,
    pub methodIndexIndex: GenericInstIndex,
}
#[test]
fn bindgen_test_layout_Il2CppMethodSpec() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodSpec>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppMethodSpec))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodSpec>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppMethodSpec))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodSpec>())).methodDefinitionIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodSpec),
            "::",
            stringify!(methodDefinitionIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodSpec>())).classIndexIndex as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodSpec),
            "::",
            stringify!(classIndexIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodSpec>())).methodIndexIndex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodSpec),
            "::",
            stringify!(methodIndexIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppStringLiteral {
    pub length: u32,
    pub dataIndex: StringLiteralIndex,
}
#[test]
fn bindgen_test_layout_Il2CppStringLiteral() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppStringLiteral>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppStringLiteral))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppStringLiteral>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppStringLiteral))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStringLiteral>())).length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStringLiteral),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStringLiteral>())).dataIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStringLiteral),
            "::",
            stringify!(dataIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericMethodIndices {
    pub methodIndex: MethodIndex,
    pub invokerIndex: MethodIndex,
}
#[test]
fn bindgen_test_layout_Il2CppGenericMethodIndices() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericMethodIndices>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppGenericMethodIndices))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericMethodIndices>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppGenericMethodIndices))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericMethodIndices>())).methodIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericMethodIndices),
            "::",
            stringify!(methodIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericMethodIndices>())).invokerIndex as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericMethodIndices),
            "::",
            stringify!(invokerIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericMethodFunctionsDefinitions {
    pub genericMethodIndex: GenericMethodIndex,
    pub indices: Il2CppGenericMethodIndices,
}
#[test]
fn bindgen_test_layout_Il2CppGenericMethodFunctionsDefinitions() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericMethodFunctionsDefinitions>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppGenericMethodFunctionsDefinitions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericMethodFunctionsDefinitions>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppGenericMethodFunctionsDefinitions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericMethodFunctionsDefinitions>())).genericMethodIndex
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericMethodFunctionsDefinitions),
            "::",
            stringify!(genericMethodIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericMethodFunctionsDefinitions>())).indices as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericMethodFunctionsDefinitions),
            "::",
            stringify!(indices)
        )
    );
}
pub const kPublicKeyByteLength: ::std::os::raw::c_int = 8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppAssemblyNameDefinition {
    pub nameIndex: StringIndex,
    pub cultureIndex: StringIndex,
    pub publicKeyIndex: StringIndex,
    pub hash_alg: u32,
    pub hash_len: i32,
    pub flags: u32,
    pub major: i32,
    pub minor: i32,
    pub build: i32,
    pub revision: i32,
    pub public_key_token: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_Il2CppAssemblyNameDefinition() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppAssemblyNameDefinition>(),
        48usize,
        concat!("Size of: ", stringify!(Il2CppAssemblyNameDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppAssemblyNameDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppAssemblyNameDefinition))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyNameDefinition>())).nameIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyNameDefinition>())).cultureIndex as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(cultureIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyNameDefinition>())).publicKeyIndex as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(publicKeyIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyNameDefinition>())).hash_alg as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(hash_alg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyNameDefinition>())).hash_len as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(hash_len)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyNameDefinition>())).flags as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyNameDefinition>())).major as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyNameDefinition>())).minor as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyNameDefinition>())).build as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(build)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyNameDefinition>())).revision as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(revision)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyNameDefinition>())).public_key_token as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(public_key_token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppImageDefinition {
    pub nameIndex: StringIndex,
    pub assemblyIndex: AssemblyIndex,
    pub typeStart: TypeDefinitionIndex,
    pub typeCount: u32,
    pub exportedTypeStart: TypeDefinitionIndex,
    pub exportedTypeCount: u32,
    pub entryPointIndex: MethodIndex,
    pub token: u32,
    pub customAttributeStart: CustomAttributeIndex,
    pub customAttributeCount: u32,
}
#[test]
fn bindgen_test_layout_Il2CppImageDefinition() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppImageDefinition>(),
        40usize,
        concat!("Size of: ", stringify!(Il2CppImageDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppImageDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppImageDefinition))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppImageDefinition>())).nameIndex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppImageDefinition>())).assemblyIndex as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(assemblyIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppImageDefinition>())).typeStart as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(typeStart)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppImageDefinition>())).typeCount as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(typeCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppImageDefinition>())).exportedTypeStart as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(exportedTypeStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppImageDefinition>())).exportedTypeCount as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(exportedTypeCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppImageDefinition>())).entryPointIndex as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(entryPointIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppImageDefinition>())).token as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppImageDefinition>())).customAttributeStart as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(customAttributeStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppImageDefinition>())).customAttributeCount as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(customAttributeCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppAssemblyDefinition {
    pub imageIndex: ImageIndex,
    pub token: u32,
    pub referencedAssemblyStart: i32,
    pub referencedAssemblyCount: i32,
    pub aname: Il2CppAssemblyNameDefinition,
}
#[test]
fn bindgen_test_layout_Il2CppAssemblyDefinition() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppAssemblyDefinition>(),
        64usize,
        concat!("Size of: ", stringify!(Il2CppAssemblyDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppAssemblyDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppAssemblyDefinition))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyDefinition>())).imageIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyDefinition),
            "::",
            stringify!(imageIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppAssemblyDefinition>())).token as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyDefinition),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyDefinition>())).referencedAssemblyStart as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyDefinition),
            "::",
            stringify!(referencedAssemblyStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppAssemblyDefinition>())).referencedAssemblyCount as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyDefinition),
            "::",
            stringify!(referencedAssemblyCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppAssemblyDefinition>())).aname as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyDefinition),
            "::",
            stringify!(aname)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMetadataUsageList {
    pub start: u32,
    pub count: u32,
}
#[test]
fn bindgen_test_layout_Il2CppMetadataUsageList() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppMetadataUsageList>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppMetadataUsageList))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMetadataUsageList>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppMetadataUsageList))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppMetadataUsageList>())).start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataUsageList),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppMetadataUsageList>())).count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataUsageList),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMetadataUsagePair {
    pub destinationIndex: u32,
    pub encodedSourceIndex: u32,
}
#[test]
fn bindgen_test_layout_Il2CppMetadataUsagePair() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppMetadataUsagePair>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppMetadataUsagePair))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMetadataUsagePair>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppMetadataUsagePair))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMetadataUsagePair>())).destinationIndex as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataUsagePair),
            "::",
            stringify!(destinationIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMetadataUsagePair>())).encodedSourceIndex as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataUsagePair),
            "::",
            stringify!(encodedSourceIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppCustomAttributeTypeRange {
    pub token: u32,
    pub start: i32,
    pub count: i32,
}
#[test]
fn bindgen_test_layout_Il2CppCustomAttributeTypeRange() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppCustomAttributeTypeRange>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppCustomAttributeTypeRange))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppCustomAttributeTypeRange>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppCustomAttributeTypeRange))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppCustomAttributeTypeRange>())).token as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppCustomAttributeTypeRange),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppCustomAttributeTypeRange>())).start as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppCustomAttributeTypeRange),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppCustomAttributeTypeRange>())).count as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppCustomAttributeTypeRange),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppRange {
    pub start: i32,
    pub length: i32,
}
#[test]
fn bindgen_test_layout_Il2CppRange() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppRange>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppRange))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppRange>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppRange))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppRange>())).start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRange),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppRange>())).length as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRange),
            "::",
            stringify!(length)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppWindowsRuntimeTypeNamePair {
    pub nameIndex: StringIndex,
    pub typeIndex: TypeIndex,
}
#[test]
fn bindgen_test_layout_Il2CppWindowsRuntimeTypeNamePair() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppWindowsRuntimeTypeNamePair>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppWindowsRuntimeTypeNamePair))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWindowsRuntimeTypeNamePair>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppWindowsRuntimeTypeNamePair)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppWindowsRuntimeTypeNamePair>())).nameIndex as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWindowsRuntimeTypeNamePair),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppWindowsRuntimeTypeNamePair>())).typeIndex as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWindowsRuntimeTypeNamePair),
            "::",
            stringify!(typeIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGlobalMetadataHeader {
    pub sanity: i32,
    pub version: i32,
    pub stringLiteralOffset: i32,
    pub stringLiteralCount: i32,
    pub stringLiteralDataOffset: i32,
    pub stringLiteralDataCount: i32,
    pub stringOffset: i32,
    pub stringCount: i32,
    pub eventsOffset: i32,
    pub eventsCount: i32,
    pub propertiesOffset: i32,
    pub propertiesCount: i32,
    pub methodsOffset: i32,
    pub methodsCount: i32,
    pub parameterDefaultValuesOffset: i32,
    pub parameterDefaultValuesCount: i32,
    pub fieldDefaultValuesOffset: i32,
    pub fieldDefaultValuesCount: i32,
    pub fieldAndParameterDefaultValueDataOffset: i32,
    pub fieldAndParameterDefaultValueDataCount: i32,
    pub fieldMarshaledSizesOffset: i32,
    pub fieldMarshaledSizesCount: i32,
    pub parametersOffset: i32,
    pub parametersCount: i32,
    pub fieldsOffset: i32,
    pub fieldsCount: i32,
    pub genericParametersOffset: i32,
    pub genericParametersCount: i32,
    pub genericParameterConstraintsOffset: i32,
    pub genericParameterConstraintsCount: i32,
    pub genericContainersOffset: i32,
    pub genericContainersCount: i32,
    pub nestedTypesOffset: i32,
    pub nestedTypesCount: i32,
    pub interfacesOffset: i32,
    pub interfacesCount: i32,
    pub vtableMethodsOffset: i32,
    pub vtableMethodsCount: i32,
    pub interfaceOffsetsOffset: i32,
    pub interfaceOffsetsCount: i32,
    pub typeDefinitionsOffset: i32,
    pub typeDefinitionsCount: i32,
    pub imagesOffset: i32,
    pub imagesCount: i32,
    pub assembliesOffset: i32,
    pub assembliesCount: i32,
    pub metadataUsageListsOffset: i32,
    pub metadataUsageListsCount: i32,
    pub metadataUsagePairsOffset: i32,
    pub metadataUsagePairsCount: i32,
    pub fieldRefsOffset: i32,
    pub fieldRefsCount: i32,
    pub referencedAssembliesOffset: i32,
    pub referencedAssembliesCount: i32,
    pub attributesInfoOffset: i32,
    pub attributesInfoCount: i32,
    pub attributeTypesOffset: i32,
    pub attributeTypesCount: i32,
    pub unresolvedVirtualCallParameterTypesOffset: i32,
    pub unresolvedVirtualCallParameterTypesCount: i32,
    pub unresolvedVirtualCallParameterRangesOffset: i32,
    pub unresolvedVirtualCallParameterRangesCount: i32,
    pub windowsRuntimeTypeNamesOffset: i32,
    pub windowsRuntimeTypeNamesSize: i32,
    pub exportedTypeDefinitionsOffset: i32,
    pub exportedTypeDefinitionsCount: i32,
}
#[test]
fn bindgen_test_layout_Il2CppGlobalMetadataHeader() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppGlobalMetadataHeader>(),
        264usize,
        concat!("Size of: ", stringify!(Il2CppGlobalMetadataHeader))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGlobalMetadataHeader>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppGlobalMetadataHeader))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).sanity as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(sanity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).version as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).stringLiteralOffset as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(stringLiteralOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).stringLiteralCount as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(stringLiteralCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).stringLiteralDataOffset
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(stringLiteralDataOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).stringLiteralDataCount
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(stringLiteralDataCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).stringOffset as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(stringOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).stringCount as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(stringCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).eventsOffset as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(eventsOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).eventsCount as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(eventsCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).propertiesOffset as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(propertiesOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).propertiesCount as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(propertiesCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).methodsOffset as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(methodsOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).methodsCount as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(methodsCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).parameterDefaultValuesOffset
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(parameterDefaultValuesOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).parameterDefaultValuesCount
                as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(parameterDefaultValuesCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).fieldDefaultValuesOffset
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldDefaultValuesOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).fieldDefaultValuesCount
                as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldDefaultValuesCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>()))
                .fieldAndParameterDefaultValueDataOffset as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldAndParameterDefaultValueDataOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>()))
                .fieldAndParameterDefaultValueDataCount as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldAndParameterDefaultValueDataCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).fieldMarshaledSizesOffset
                as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldMarshaledSizesOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).fieldMarshaledSizesCount
                as *const _ as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldMarshaledSizesCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).parametersOffset as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(parametersOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).parametersCount as *const _
                as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(parametersCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).fieldsOffset as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldsOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).fieldsCount as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldsCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).genericParametersOffset
                as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(genericParametersOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).genericParametersCount
                as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(genericParametersCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).genericParameterConstraintsOffset
                as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(genericParameterConstraintsOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).genericParameterConstraintsCount
                as *const _ as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(genericParameterConstraintsCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).genericContainersOffset
                as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(genericContainersOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).genericContainersCount
                as *const _ as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(genericContainersCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).nestedTypesOffset as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(nestedTypesOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).nestedTypesCount as *const _
                as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(nestedTypesCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).interfacesOffset as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(interfacesOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).interfacesCount as *const _
                as usize
        },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(interfacesCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).vtableMethodsOffset as *const _
                as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(vtableMethodsOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).vtableMethodsCount as *const _
                as usize
        },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(vtableMethodsCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).interfaceOffsetsOffset
                as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(interfaceOffsetsOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).interfaceOffsetsCount as *const _
                as usize
        },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(interfaceOffsetsCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).typeDefinitionsOffset as *const _
                as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(typeDefinitionsOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).typeDefinitionsCount as *const _
                as usize
        },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(typeDefinitionsCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).imagesOffset as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(imagesOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).imagesCount as *const _ as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(imagesCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).assembliesOffset as *const _
                as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(assembliesOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).assembliesCount as *const _
                as usize
        },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(assembliesCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).metadataUsageListsOffset
                as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(metadataUsageListsOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).metadataUsageListsCount
                as *const _ as usize
        },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(metadataUsageListsCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).metadataUsagePairsOffset
                as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(metadataUsagePairsOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).metadataUsagePairsCount
                as *const _ as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(metadataUsagePairsCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).fieldRefsOffset as *const _
                as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldRefsOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).fieldRefsCount as *const _
                as usize
        },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldRefsCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).referencedAssembliesOffset
                as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(referencedAssembliesOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).referencedAssembliesCount
                as *const _ as usize
        },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(referencedAssembliesCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).attributesInfoOffset as *const _
                as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(attributesInfoOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).attributesInfoCount as *const _
                as usize
        },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(attributesInfoCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).attributeTypesOffset as *const _
                as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(attributeTypesOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).attributeTypesCount as *const _
                as usize
        },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(attributeTypesCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>()))
                .unresolvedVirtualCallParameterTypesOffset as *const _ as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(unresolvedVirtualCallParameterTypesOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>()))
                .unresolvedVirtualCallParameterTypesCount as *const _ as usize
        },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(unresolvedVirtualCallParameterTypesCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>()))
                .unresolvedVirtualCallParameterRangesOffset as *const _ as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(unresolvedVirtualCallParameterRangesOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>()))
                .unresolvedVirtualCallParameterRangesCount as *const _ as usize
        },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(unresolvedVirtualCallParameterRangesCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).windowsRuntimeTypeNamesOffset
                as *const _ as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(windowsRuntimeTypeNamesOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).windowsRuntimeTypeNamesSize
                as *const _ as usize
        },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(windowsRuntimeTypeNamesSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).exportedTypeDefinitionsOffset
                as *const _ as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(exportedTypeDefinitionsOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGlobalMetadataHeader>())).exportedTypeDefinitionsCount
                as *const _ as usize
        },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(exportedTypeDefinitionsCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppArrayType {
    pub etype: *const Il2CppType,
    pub rank: u8,
    pub numsizes: u8,
    pub numlobounds: u8,
    pub sizes: *mut ::std::os::raw::c_int,
    pub lobounds: *mut ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Il2CppArrayType() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppArrayType>(),
        32usize,
        concat!("Size of: ", stringify!(Il2CppArrayType))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppArrayType>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppArrayType))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppArrayType>())).etype as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppArrayType),
            "::",
            stringify!(etype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppArrayType>())).rank as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppArrayType),
            "::",
            stringify!(rank)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppArrayType>())).numsizes as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppArrayType),
            "::",
            stringify!(numsizes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppArrayType>())).numlobounds as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppArrayType),
            "::",
            stringify!(numlobounds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppArrayType>())).sizes as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppArrayType),
            "::",
            stringify!(sizes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppArrayType>())).lobounds as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppArrayType),
            "::",
            stringify!(lobounds)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericInst {
    pub type_argc: u32,
    pub type_argv: *mut *const Il2CppType,
}
#[test]
fn bindgen_test_layout_Il2CppGenericInst() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericInst>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppGenericInst))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericInst>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppGenericInst))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppGenericInst>())).type_argc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericInst),
            "::",
            stringify!(type_argc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppGenericInst>())).type_argv as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericInst),
            "::",
            stringify!(type_argv)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericContext {
    pub class_inst: *const Il2CppGenericInst,
    pub method_inst: *const Il2CppGenericInst,
}
#[test]
fn bindgen_test_layout_Il2CppGenericContext() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericContext>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppGenericContext))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericContext>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppGenericContext))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppGenericContext>())).class_inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericContext),
            "::",
            stringify!(class_inst)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericContext>())).method_inst as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericContext),
            "::",
            stringify!(method_inst)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericParameter {
    pub ownerIndex: GenericContainerIndex,
    pub nameIndex: StringIndex,
    pub constraintsStart: GenericParameterConstraintIndex,
    pub constraintsCount: i16,
    pub num: u16,
    pub flags: u16,
}
#[test]
fn bindgen_test_layout_Il2CppGenericParameter() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericParameter>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppGenericParameter))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericParameter>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppGenericParameter))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericParameter>())).ownerIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameter),
            "::",
            stringify!(ownerIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericParameter>())).nameIndex as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameter),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericParameter>())).constraintsStart as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameter),
            "::",
            stringify!(constraintsStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericParameter>())).constraintsCount as *const _ as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameter),
            "::",
            stringify!(constraintsCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppGenericParameter>())).num as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameter),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppGenericParameter>())).flags as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameter),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericContainer {
    pub ownerIndex: i32,
    pub type_argc: i32,
    pub is_method: i32,
    pub genericParameterStart: GenericParameterIndex,
}
#[test]
fn bindgen_test_layout_Il2CppGenericContainer() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericContainer>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppGenericContainer))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericContainer>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppGenericContainer))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericContainer>())).ownerIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericContainer),
            "::",
            stringify!(ownerIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericContainer>())).type_argc as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericContainer),
            "::",
            stringify!(type_argc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericContainer>())).is_method as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericContainer),
            "::",
            stringify!(is_method)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericContainer>())).genericParameterStart as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericContainer),
            "::",
            stringify!(genericParameterStart)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericClass {
    pub typeDefinitionIndex: TypeDefinitionIndex,
    pub context: Il2CppGenericContext,
    pub cached_class: *mut Il2CppClass,
}
#[test]
fn bindgen_test_layout_Il2CppGenericClass() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericClass>(),
        32usize,
        concat!("Size of: ", stringify!(Il2CppGenericClass))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericClass>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppGenericClass))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericClass>())).typeDefinitionIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericClass),
            "::",
            stringify!(typeDefinitionIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppGenericClass>())).context as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericClass),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppGenericClass>())).cached_class as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericClass),
            "::",
            stringify!(cached_class)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericMethod {
    pub methodDefinition: *const MethodInfo,
    pub context: Il2CppGenericContext,
}
#[test]
fn bindgen_test_layout_Il2CppGenericMethod() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericMethod>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppGenericMethod))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericMethod>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppGenericMethod))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppGenericMethod>())).methodDefinition as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericMethod),
            "::",
            stringify!(methodDefinition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppGenericMethod>())).context as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericMethod),
            "::",
            stringify!(context)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Il2CppType {
    pub data: Il2CppType__bindgen_ty_1,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub __bindgen_padding_0: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppType__bindgen_ty_1 {
    pub dummy: *mut ::std::os::raw::c_void,
    pub klassIndex: TypeDefinitionIndex,
    pub type_: *const Il2CppType,
    pub array: *mut Il2CppArrayType,
    pub genericParameterIndex: GenericParameterIndex,
    pub generic_class: *mut Il2CppGenericClass,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_Il2CppType__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppType__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppType__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppType__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppType__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppType__bindgen_ty_1>())).dummy as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppType__bindgen_ty_1>())).klassIndex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(klassIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppType__bindgen_ty_1>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppType__bindgen_ty_1>())).array as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(array)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppType__bindgen_ty_1>())).genericParameterIndex as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(genericParameterIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppType__bindgen_ty_1>())).generic_class as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(generic_class)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppType() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppType>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppType))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppType>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppType))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppType>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType),
            "::",
            stringify!(data)
        )
    );
}
impl Il2CppType {
    #[inline]
    pub fn attrs(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_attrs(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> Il2CppTypeEnum {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: Il2CppTypeEnum) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn num_mods(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 6u8) as u32) }
    }
    #[inline]
    pub fn set_num_mods(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn byref(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_byref(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pinned(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_pinned(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        attrs: ::std::os::raw::c_uint,
        type_: Il2CppTypeEnum,
        num_mods: ::std::os::raw::c_uint,
        byref: ::std::os::raw::c_uint,
        pinned: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let attrs: u32 = unsafe { ::std::mem::transmute(attrs) };
            attrs as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(24usize, 6u8, {
            let num_mods: u32 = unsafe { ::std::mem::transmute(num_mods) };
            num_mods as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let byref: u32 = unsafe { ::std::mem::transmute(byref) };
            byref as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let pinned: u32 = unsafe { ::std::mem::transmute(pinned) };
            pinned as u64
        });
        __bindgen_bitfield_unit
    }
}
pub const Il2CppCallConvention_IL2CPP_CALL_DEFAULT: Il2CppCallConvention = 0;
pub const Il2CppCallConvention_IL2CPP_CALL_C: Il2CppCallConvention = 1;
pub const Il2CppCallConvention_IL2CPP_CALL_STDCALL: Il2CppCallConvention = 2;
pub const Il2CppCallConvention_IL2CPP_CALL_THISCALL: Il2CppCallConvention = 3;
pub const Il2CppCallConvention_IL2CPP_CALL_FASTCALL: Il2CppCallConvention = 4;
pub const Il2CppCallConvention_IL2CPP_CALL_VARARG: Il2CppCallConvention = 5;
pub type Il2CppCallConvention = ::std::os::raw::c_uint;
pub const Il2CppCharSet_CHARSET_ANSI: Il2CppCharSet = 0;
pub const Il2CppCharSet_CHARSET_UNICODE: Il2CppCharSet = 1;
pub const Il2CppCharSet_CHARSET_NOT_SPECIFIED: Il2CppCharSet = 2;
pub type Il2CppCharSet = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppHString__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Il2CppHString__() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppHString__>(),
        4usize,
        concat!("Size of: ", stringify!(Il2CppHString__))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppHString__>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppHString__))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppHString__>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppHString__),
            "::",
            stringify!(unused)
        )
    );
}
pub type Il2CppHString = *mut Il2CppHString__;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Il2CppHStringHeader {
    pub Reserved: Il2CppHStringHeader__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppHStringHeader__bindgen_ty_1 {
    pub Reserved1: *mut ::std::os::raw::c_void,
    pub Reserved2: [::std::os::raw::c_char; 24usize],
    _bindgen_union_align: [u64; 3usize],
}
#[test]
fn bindgen_test_layout_Il2CppHStringHeader__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppHStringHeader__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppHStringHeader__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppHStringHeader__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppHStringHeader__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppHStringHeader__bindgen_ty_1>())).Reserved1 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppHStringHeader__bindgen_ty_1),
            "::",
            stringify!(Reserved1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppHStringHeader__bindgen_ty_1>())).Reserved2 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppHStringHeader__bindgen_ty_1),
            "::",
            stringify!(Reserved2)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppHStringHeader() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppHStringHeader>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppHStringHeader))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppHStringHeader>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppHStringHeader))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppHStringHeader>())).Reserved as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppHStringHeader),
            "::",
            stringify!(Reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGuid {
    pub data1: u32,
    pub data2: u16,
    pub data3: u16,
    pub data4: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_Il2CppGuid() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppGuid>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppGuid))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGuid>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppGuid))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppGuid>())).data1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGuid),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppGuid>())).data2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGuid),
            "::",
            stringify!(data2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppGuid>())).data3 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGuid),
            "::",
            stringify!(data3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppGuid>())).data4 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGuid),
            "::",
            stringify!(data4)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppSafeArrayBound {
    pub element_count: u32,
    pub lower_bound: i32,
}
#[test]
fn bindgen_test_layout_Il2CppSafeArrayBound() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppSafeArrayBound>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppSafeArrayBound))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppSafeArrayBound>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppSafeArrayBound))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppSafeArrayBound>())).element_count as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArrayBound),
            "::",
            stringify!(element_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppSafeArrayBound>())).lower_bound as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArrayBound),
            "::",
            stringify!(lower_bound)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppSafeArray {
    pub dimension_count: u16,
    pub features: u16,
    pub element_size: u32,
    pub lock_count: u32,
    pub data: *mut ::std::os::raw::c_void,
    pub bounds: [Il2CppSafeArrayBound; 1usize],
}
#[test]
fn bindgen_test_layout_Il2CppSafeArray() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppSafeArray>(),
        32usize,
        concat!("Size of: ", stringify!(Il2CppSafeArray))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppSafeArray>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppSafeArray))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppSafeArray>())).dimension_count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArray),
            "::",
            stringify!(dimension_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppSafeArray>())).features as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArray),
            "::",
            stringify!(features)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppSafeArray>())).element_size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArray),
            "::",
            stringify!(element_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppSafeArray>())).lock_count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArray),
            "::",
            stringify!(lock_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppSafeArray>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArray),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppSafeArray>())).bounds as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArray),
            "::",
            stringify!(bounds)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Il2CppWin32Decimal {
    pub reserved: u16,
    pub u: Il2CppWin32Decimal__bindgen_ty_1,
    pub hi32: u32,
    pub u2: Il2CppWin32Decimal__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppWin32Decimal__bindgen_ty_1 {
    pub s: Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1,
    pub signscale: u16,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1 {
    pub scale: u8,
    pub sign: u8,
}
#[test]
fn bindgen_test_layout_Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1>())).scale
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1>())).sign
                as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(sign)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppWin32Decimal__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppWin32Decimal__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(Il2CppWin32Decimal__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWin32Decimal__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppWin32Decimal__bindgen_ty_1>())).s as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppWin32Decimal__bindgen_ty_1>())).signscale as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1),
            "::",
            stringify!(signscale)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppWin32Decimal__bindgen_ty_2 {
    pub s2: Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1,
    pub lo64: u64,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1 {
    pub lo32: u32,
    pub mid32: u32,
}
#[test]
fn bindgen_test_layout_Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1>())).lo32
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(lo32)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1>())).mid32
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(mid32)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppWin32Decimal__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppWin32Decimal__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppWin32Decimal__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWin32Decimal__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppWin32Decimal__bindgen_ty_2>())).s2 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2),
            "::",
            stringify!(s2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppWin32Decimal__bindgen_ty_2>())).lo64 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2),
            "::",
            stringify!(lo64)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppWin32Decimal() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppWin32Decimal>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppWin32Decimal))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWin32Decimal>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppWin32Decimal))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppWin32Decimal>())).reserved as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppWin32Decimal>())).u as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppWin32Decimal>())).hi32 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal),
            "::",
            stringify!(hi32)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppWin32Decimal>())).u2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal),
            "::",
            stringify!(u2)
        )
    );
}
pub type IL2CPP_VARIANT_BOOL = i16;
pub const Il2CppVarType_IL2CPP_VT_EMPTY: Il2CppVarType = 0;
pub const Il2CppVarType_IL2CPP_VT_NULL: Il2CppVarType = 1;
pub const Il2CppVarType_IL2CPP_VT_I2: Il2CppVarType = 2;
pub const Il2CppVarType_IL2CPP_VT_I4: Il2CppVarType = 3;
pub const Il2CppVarType_IL2CPP_VT_R4: Il2CppVarType = 4;
pub const Il2CppVarType_IL2CPP_VT_R8: Il2CppVarType = 5;
pub const Il2CppVarType_IL2CPP_VT_CY: Il2CppVarType = 6;
pub const Il2CppVarType_IL2CPP_VT_DATE: Il2CppVarType = 7;
pub const Il2CppVarType_IL2CPP_VT_BSTR: Il2CppVarType = 8;
pub const Il2CppVarType_IL2CPP_VT_DISPATCH: Il2CppVarType = 9;
pub const Il2CppVarType_IL2CPP_VT_ERROR: Il2CppVarType = 10;
pub const Il2CppVarType_IL2CPP_VT_BOOL: Il2CppVarType = 11;
pub const Il2CppVarType_IL2CPP_VT_VARIANT: Il2CppVarType = 12;
pub const Il2CppVarType_IL2CPP_VT_UNKNOWN: Il2CppVarType = 13;
pub const Il2CppVarType_IL2CPP_VT_DECIMAL: Il2CppVarType = 14;
pub const Il2CppVarType_IL2CPP_VT_I1: Il2CppVarType = 16;
pub const Il2CppVarType_IL2CPP_VT_UI1: Il2CppVarType = 17;
pub const Il2CppVarType_IL2CPP_VT_UI2: Il2CppVarType = 18;
pub const Il2CppVarType_IL2CPP_VT_UI4: Il2CppVarType = 19;
pub const Il2CppVarType_IL2CPP_VT_I8: Il2CppVarType = 20;
pub const Il2CppVarType_IL2CPP_VT_UI8: Il2CppVarType = 21;
pub const Il2CppVarType_IL2CPP_VT_INT: Il2CppVarType = 22;
pub const Il2CppVarType_IL2CPP_VT_UINT: Il2CppVarType = 23;
pub const Il2CppVarType_IL2CPP_VT_VOID: Il2CppVarType = 24;
pub const Il2CppVarType_IL2CPP_VT_HRESULT: Il2CppVarType = 25;
pub const Il2CppVarType_IL2CPP_VT_PTR: Il2CppVarType = 26;
pub const Il2CppVarType_IL2CPP_VT_SAFEARRAY: Il2CppVarType = 27;
pub const Il2CppVarType_IL2CPP_VT_CARRAY: Il2CppVarType = 28;
pub const Il2CppVarType_IL2CPP_VT_USERDEFINED: Il2CppVarType = 29;
pub const Il2CppVarType_IL2CPP_VT_LPSTR: Il2CppVarType = 30;
pub const Il2CppVarType_IL2CPP_VT_LPWSTR: Il2CppVarType = 31;
pub const Il2CppVarType_IL2CPP_VT_RECORD: Il2CppVarType = 36;
pub const Il2CppVarType_IL2CPP_VT_INT_PTR: Il2CppVarType = 37;
pub const Il2CppVarType_IL2CPP_VT_UINT_PTR: Il2CppVarType = 38;
pub const Il2CppVarType_IL2CPP_VT_FILETIME: Il2CppVarType = 64;
pub const Il2CppVarType_IL2CPP_VT_BLOB: Il2CppVarType = 65;
pub const Il2CppVarType_IL2CPP_VT_STREAM: Il2CppVarType = 66;
pub const Il2CppVarType_IL2CPP_VT_STORAGE: Il2CppVarType = 67;
pub const Il2CppVarType_IL2CPP_VT_STREAMED_OBJECT: Il2CppVarType = 68;
pub const Il2CppVarType_IL2CPP_VT_STORED_OBJECT: Il2CppVarType = 69;
pub const Il2CppVarType_IL2CPP_VT_BLOB_OBJECT: Il2CppVarType = 70;
pub const Il2CppVarType_IL2CPP_VT_CF: Il2CppVarType = 71;
pub const Il2CppVarType_IL2CPP_VT_CLSID: Il2CppVarType = 72;
pub const Il2CppVarType_IL2CPP_VT_VERSIONED_STREAM: Il2CppVarType = 73;
pub const Il2CppVarType_IL2CPP_VT_BSTR_BLOB: Il2CppVarType = 4095;
pub const Il2CppVarType_IL2CPP_VT_VECTOR: Il2CppVarType = 4096;
pub const Il2CppVarType_IL2CPP_VT_ARRAY: Il2CppVarType = 8192;
pub const Il2CppVarType_IL2CPP_VT_BYREF: Il2CppVarType = 16384;
pub const Il2CppVarType_IL2CPP_VT_RESERVED: Il2CppVarType = 32768;
pub const Il2CppVarType_IL2CPP_VT_ILLEGAL: Il2CppVarType = 65535;
pub const Il2CppVarType_IL2CPP_VT_ILLEGALMASKED: Il2CppVarType = 4095;
pub const Il2CppVarType_IL2CPP_VT_TYPEMASK: Il2CppVarType = 4095;
pub type Il2CppVarType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppIUnknown {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Il2CppVariant {
    pub n1: Il2CppVariant__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppVariant__bindgen_ty_1 {
    pub n2: Il2CppVariant__bindgen_ty_1___tagVARIANT,
    pub decVal: Il2CppWin32Decimal,
    _bindgen_union_align: [u64; 3usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Il2CppVariant__bindgen_ty_1___tagVARIANT {
    pub type_: u16,
    pub reserved1: u16,
    pub reserved2: u16,
    pub reserved3: u16,
    pub n3: Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1 {
    pub llVal: i64,
    pub lVal: i32,
    pub bVal: u8,
    pub iVal: i16,
    pub fltVal: f32,
    pub dblVal: f64,
    pub boolVal: IL2CPP_VARIANT_BOOL,
    pub scode: i32,
    pub cyVal: i64,
    pub date: f64,
    pub bstrVal: *mut Il2CppChar,
    pub punkVal: *mut Il2CppIUnknown,
    pub pdispVal: *mut ::std::os::raw::c_void,
    pub parray: *mut Il2CppSafeArray,
    pub pbVal: *mut u8,
    pub piVal: *mut i16,
    pub plVal: *mut i32,
    pub pllVal: *mut i64,
    pub pfltVal: *mut f32,
    pub pdblVal: *mut f64,
    pub pboolVal: *mut IL2CPP_VARIANT_BOOL,
    pub pscode: *mut i32,
    pub pcyVal: *mut i64,
    pub pdate: *mut f64,
    pub pbstrVal: *mut Il2CppChar,
    pub ppunkVal: *mut *mut Il2CppIUnknown,
    pub ppdispVal: *mut *mut ::std::os::raw::c_void,
    pub pparray: *mut *mut Il2CppSafeArray,
    pub pvarVal: *mut Il2CppVariant,
    pub byref: *mut ::std::os::raw::c_void,
    pub cVal: ::std::os::raw::c_char,
    pub uiVal: u16,
    pub ulVal: u32,
    pub ullVal: u64,
    pub intVal: ::std::os::raw::c_int,
    pub uintVal: ::std::os::raw::c_uint,
    pub pdecVal: *mut Il2CppWin32Decimal,
    pub pcVal: *mut ::std::os::raw::c_char,
    pub puiVal: *mut u16,
    pub pulVal: *mut u32,
    pub pullVal: *mut u64,
    pub pintVal: *mut ::std::os::raw::c_int,
    pub puintVal: *mut ::std::os::raw::c_uint,
    pub n4: Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD {
    pub pvRecord: *mut ::std::os::raw::c_void,
    pub pRecInfo: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD>(
        ),
        16usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD>(
        ),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<
                Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD,
            >()))
            .pvRecord as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD),
            "::",
            stringify!(pvRecord)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<
                Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD,
            >()))
            .pRecInfo as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD),
            "::",
            stringify!(pRecInfo)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).llVal
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(llVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).lVal
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(lVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).bVal
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(bVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).iVal
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(iVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .fltVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(fltVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .dblVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(dblVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .boolVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(boolVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).scode
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(scode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).cyVal
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(cyVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).date
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(date)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .bstrVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(bstrVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .punkVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(punkVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pdispVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pdispVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .parray as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(parray)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).pbVal
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pbVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).piVal
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(piVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).plVal
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(plVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pllVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pllVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pfltVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pfltVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pdblVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pdblVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pboolVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pboolVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pscode as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pscode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pcyVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pcyVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).pdate
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pdate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pbstrVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pbstrVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .ppunkVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(ppunkVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .ppdispVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(ppdispVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pparray as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pparray)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pvarVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pvarVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).byref
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(byref)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).cVal
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(cVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).uiVal
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(uiVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).ulVal
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(ulVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .ullVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(ullVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .intVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(intVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .uintVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(uintVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pdecVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pdecVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).pcVal
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pcVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .puiVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(puiVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pulVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pulVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pullVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pullVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .pintVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pintVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>()))
                .puintVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(puintVal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>())).n4
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(n4)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppVariant__bindgen_ty_1___tagVARIANT() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppVariant__bindgen_ty_1___tagVARIANT>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppVariant__bindgen_ty_1___tagVARIANT>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT>())).type_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT>())).reserved1
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT>())).reserved2
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT>())).reserved3
                as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1___tagVARIANT>())).n3 as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT),
            "::",
            stringify!(n3)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppVariant__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppVariant__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppVariant__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppVariant__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppVariant__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1>())).n2 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1),
            "::",
            stringify!(n2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppVariant__bindgen_ty_1>())).decVal as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1),
            "::",
            stringify!(decVal)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppVariant() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppVariant>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppVariant))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppVariant>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppVariant))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppVariant>())).n1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant),
            "::",
            stringify!(n1)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppFileTime {
    pub low: u32,
    pub high: u32,
}
#[test]
fn bindgen_test_layout_Il2CppFileTime() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppFileTime>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppFileTime))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppFileTime>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppFileTime))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppFileTime>())).low as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFileTime),
            "::",
            stringify!(low)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppFileTime>())).high as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFileTime),
            "::",
            stringify!(high)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppStatStg {
    pub name: *mut Il2CppChar,
    pub type_: u32,
    pub size: u64,
    pub mtime: Il2CppFileTime,
    pub ctime: Il2CppFileTime,
    pub atime: Il2CppFileTime,
    pub mode: u32,
    pub locks: u32,
    pub clsid: Il2CppGuid,
    pub state: u32,
    pub reserved: u32,
}
#[test]
fn bindgen_test_layout_Il2CppStatStg() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppStatStg>(),
        80usize,
        concat!("Size of: ", stringify!(Il2CppStatStg))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppStatStg>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppStatStg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStatStg>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStatStg>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStatStg>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStatStg>())).mtime as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(mtime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStatStg>())).ctime as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(ctime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStatStg>())).atime as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(atime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStatStg>())).mode as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStatStg>())).locks as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(locks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStatStg>())).clsid as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(clsid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStatStg>())).state as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppStatStg>())).reserved as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(reserved)
        )
    );
}
pub const Il2CppWindowsRuntimeTypeKind_kTypeKindPrimitive: Il2CppWindowsRuntimeTypeKind = 0;
pub const Il2CppWindowsRuntimeTypeKind_kTypeKindMetadata: Il2CppWindowsRuntimeTypeKind = 1;
pub const Il2CppWindowsRuntimeTypeKind_kTypeKindCustom: Il2CppWindowsRuntimeTypeKind = 2;
pub type Il2CppWindowsRuntimeTypeKind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppWindowsRuntimeTypeName {
    pub typeName: Il2CppHString,
    pub typeKind: Il2CppWindowsRuntimeTypeKind,
}
#[test]
fn bindgen_test_layout_Il2CppWindowsRuntimeTypeName() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppWindowsRuntimeTypeName>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppWindowsRuntimeTypeName))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWindowsRuntimeTypeName>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppWindowsRuntimeTypeName))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppWindowsRuntimeTypeName>())).typeName as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWindowsRuntimeTypeName),
            "::",
            stringify!(typeName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppWindowsRuntimeTypeName>())).typeKind as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWindowsRuntimeTypeName),
            "::",
            stringify!(typeKind)
        )
    );
}
pub type PInvokeMarshalToNativeFunc = ::std::option::Option<
    unsafe extern "C" fn(
        managedStructure: *mut ::std::os::raw::c_void,
        marshaledStructure: *mut ::std::os::raw::c_void,
    ),
>;
pub type PInvokeMarshalFromNativeFunc = ::std::option::Option<
    unsafe extern "C" fn(
        marshaledStructure: *mut ::std::os::raw::c_void,
        managedStructure: *mut ::std::os::raw::c_void,
    ),
>;
pub type PInvokeMarshalCleanupFunc =
    ::std::option::Option<unsafe extern "C" fn(marshaledStructure: *mut ::std::os::raw::c_void)>;
pub type CreateCCWFunc =
    ::std::option::Option<unsafe extern "C" fn(obj: *mut Il2CppObject) -> *mut Il2CppIUnknown>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppInteropData {
    pub delegatePInvokeWrapperFunction: Il2CppMethodPointer,
    pub pinvokeMarshalToNativeFunction: PInvokeMarshalToNativeFunc,
    pub pinvokeMarshalFromNativeFunction: PInvokeMarshalFromNativeFunc,
    pub pinvokeMarshalCleanupFunction: PInvokeMarshalCleanupFunc,
    pub createCCWFunction: CreateCCWFunc,
    pub guid: *const Il2CppGuid,
    pub type_: *const Il2CppType,
}
#[test]
fn bindgen_test_layout_Il2CppInteropData() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppInteropData>(),
        56usize,
        concat!("Size of: ", stringify!(Il2CppInteropData))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppInteropData>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppInteropData))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppInteropData>())).delegatePInvokeWrapperFunction as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(delegatePInvokeWrapperFunction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppInteropData>())).pinvokeMarshalToNativeFunction as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(pinvokeMarshalToNativeFunction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppInteropData>())).pinvokeMarshalFromNativeFunction
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(pinvokeMarshalFromNativeFunction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppInteropData>())).pinvokeMarshalCleanupFunction as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(pinvokeMarshalCleanupFunction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppInteropData>())).createCCWFunction as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(createCCWFunction)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppInteropData>())).guid as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(guid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppInteropData>())).type_ as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppNameToTypeDefinitionIndexHashTable {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VirtualInvokeData {
    pub methodPtr: Il2CppMethodPointer,
    pub method: *const MethodInfo,
}
#[test]
fn bindgen_test_layout_VirtualInvokeData() {
    assert_eq!(
        ::std::mem::size_of::<VirtualInvokeData>(),
        16usize,
        concat!("Size of: ", stringify!(VirtualInvokeData))
    );
    assert_eq!(
        ::std::mem::align_of::<VirtualInvokeData>(),
        8usize,
        concat!("Alignment of ", stringify!(VirtualInvokeData))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<VirtualInvokeData>())).methodPtr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VirtualInvokeData),
            "::",
            stringify!(methodPtr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<VirtualInvokeData>())).method as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VirtualInvokeData),
            "::",
            stringify!(method)
        )
    );
}
pub const Il2CppTypeNameFormat_IL2CPP_TYPE_NAME_FORMAT_IL: Il2CppTypeNameFormat = 0;
pub const Il2CppTypeNameFormat_IL2CPP_TYPE_NAME_FORMAT_REFLECTION: Il2CppTypeNameFormat = 1;
pub const Il2CppTypeNameFormat_IL2CPP_TYPE_NAME_FORMAT_FULL_NAME: Il2CppTypeNameFormat = 2;
pub const Il2CppTypeNameFormat_IL2CPP_TYPE_NAME_FORMAT_ASSEMBLY_QUALIFIED: Il2CppTypeNameFormat = 3;
pub type Il2CppTypeNameFormat = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppDefaults {
    pub corlib: *mut Il2CppImage,
    pub object_class: *mut Il2CppClass,
    pub byte_class: *mut Il2CppClass,
    pub void_class: *mut Il2CppClass,
    pub boolean_class: *mut Il2CppClass,
    pub sbyte_class: *mut Il2CppClass,
    pub int16_class: *mut Il2CppClass,
    pub uint16_class: *mut Il2CppClass,
    pub int32_class: *mut Il2CppClass,
    pub uint32_class: *mut Il2CppClass,
    pub int_class: *mut Il2CppClass,
    pub uint_class: *mut Il2CppClass,
    pub int64_class: *mut Il2CppClass,
    pub uint64_class: *mut Il2CppClass,
    pub single_class: *mut Il2CppClass,
    pub double_class: *mut Il2CppClass,
    pub char_class: *mut Il2CppClass,
    pub string_class: *mut Il2CppClass,
    pub enum_class: *mut Il2CppClass,
    pub array_class: *mut Il2CppClass,
    pub delegate_class: *mut Il2CppClass,
    pub multicastdelegate_class: *mut Il2CppClass,
    pub asyncresult_class: *mut Il2CppClass,
    pub manualresetevent_class: *mut Il2CppClass,
    pub typehandle_class: *mut Il2CppClass,
    pub fieldhandle_class: *mut Il2CppClass,
    pub methodhandle_class: *mut Il2CppClass,
    pub systemtype_class: *mut Il2CppClass,
    pub monotype_class: *mut Il2CppClass,
    pub exception_class: *mut Il2CppClass,
    pub threadabortexception_class: *mut Il2CppClass,
    pub thread_class: *mut Il2CppClass,
    pub internal_thread_class: *mut Il2CppClass,
    pub appdomain_class: *mut Il2CppClass,
    pub appdomain_setup_class: *mut Il2CppClass,
    pub field_info_class: *mut Il2CppClass,
    pub method_info_class: *mut Il2CppClass,
    pub property_info_class: *mut Il2CppClass,
    pub event_info_class: *mut Il2CppClass,
    pub mono_event_info_class: *mut Il2CppClass,
    pub stringbuilder_class: *mut Il2CppClass,
    pub stack_frame_class: *mut Il2CppClass,
    pub stack_trace_class: *mut Il2CppClass,
    pub marshal_class: *mut Il2CppClass,
    pub typed_reference_class: *mut Il2CppClass,
    pub marshalbyrefobject_class: *mut Il2CppClass,
    pub generic_ilist_class: *mut Il2CppClass,
    pub generic_icollection_class: *mut Il2CppClass,
    pub generic_ienumerable_class: *mut Il2CppClass,
    pub generic_ireadonlylist_class: *mut Il2CppClass,
    pub generic_ireadonlycollection_class: *mut Il2CppClass,
    pub runtimetype_class: *mut Il2CppClass,
    pub generic_nullable_class: *mut Il2CppClass,
    pub il2cpp_com_object_class: *mut Il2CppClass,
    pub attribute_class: *mut Il2CppClass,
    pub customattribute_data_class: *mut Il2CppClass,
    pub version: *mut Il2CppClass,
    pub culture_info: *mut Il2CppClass,
    pub async_call_class: *mut Il2CppClass,
    pub assembly_class: *mut Il2CppClass,
    pub mono_assembly_class: *mut Il2CppClass,
    pub assembly_name_class: *mut Il2CppClass,
    pub mono_field_class: *mut Il2CppClass,
    pub mono_method_class: *mut Il2CppClass,
    pub mono_method_info_class: *mut Il2CppClass,
    pub mono_property_info_class: *mut Il2CppClass,
    pub parameter_info_class: *mut Il2CppClass,
    pub mono_parameter_info_class: *mut Il2CppClass,
    pub module_class: *mut Il2CppClass,
    pub pointer_class: *mut Il2CppClass,
    pub system_exception_class: *mut Il2CppClass,
    pub argument_exception_class: *mut Il2CppClass,
    pub wait_handle_class: *mut Il2CppClass,
    pub safe_handle_class: *mut Il2CppClass,
    pub sort_key_class: *mut Il2CppClass,
    pub dbnull_class: *mut Il2CppClass,
    pub error_wrapper_class: *mut Il2CppClass,
    pub missing_class: *mut Il2CppClass,
    pub value_type_class: *mut Il2CppClass,
    pub threadpool_wait_callback_class: *mut Il2CppClass,
    pub threadpool_perform_wait_callback_method: *mut MethodInfo,
    pub mono_method_message_class: *mut Il2CppClass,
    pub ireference_class: *mut Il2CppClass,
    pub ireferencearray_class: *mut Il2CppClass,
    pub ikey_value_pair_class: *mut Il2CppClass,
    pub key_value_pair_class: *mut Il2CppClass,
    pub windows_foundation_uri_class: *mut Il2CppClass,
    pub windows_foundation_iuri_runtime_class_class: *mut Il2CppClass,
    pub system_uri_class: *mut Il2CppClass,
    pub system_guid_class: *mut Il2CppClass,
    pub sbyte_shared_enum: *mut Il2CppClass,
    pub int16_shared_enum: *mut Il2CppClass,
    pub int32_shared_enum: *mut Il2CppClass,
    pub int64_shared_enum: *mut Il2CppClass,
    pub byte_shared_enum: *mut Il2CppClass,
    pub uint16_shared_enum: *mut Il2CppClass,
    pub uint32_shared_enum: *mut Il2CppClass,
    pub uint64_shared_enum: *mut Il2CppClass,
}
#[test]
fn bindgen_test_layout_Il2CppDefaults() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppDefaults>(),
        784usize,
        concat!("Size of: ", stringify!(Il2CppDefaults))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppDefaults>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppDefaults))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).corlib as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(corlib)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).object_class as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(object_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).byte_class as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(byte_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).void_class as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(void_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).boolean_class as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(boolean_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).sbyte_class as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(sbyte_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).int16_class as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int16_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).uint16_class as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint16_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).int32_class as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int32_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).uint32_class as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint32_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).int_class as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).uint_class as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).int64_class as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int64_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).uint64_class as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint64_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).single_class as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(single_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).double_class as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(double_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).char_class as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(char_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).string_class as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(string_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).enum_class as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(enum_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).array_class as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(array_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).delegate_class as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(delegate_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).multicastdelegate_class as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(multicastdelegate_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).asyncresult_class as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(asyncresult_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).manualresetevent_class as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(manualresetevent_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).typehandle_class as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(typehandle_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).fieldhandle_class as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(fieldhandle_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).methodhandle_class as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(methodhandle_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).systemtype_class as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(systemtype_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).monotype_class as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(monotype_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).exception_class as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(exception_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).threadabortexception_class as *const _
                as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(threadabortexception_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).thread_class as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(thread_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).internal_thread_class as *const _ as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(internal_thread_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).appdomain_class as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(appdomain_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).appdomain_setup_class as *const _ as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(appdomain_setup_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).field_info_class as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(field_info_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).method_info_class as *const _ as usize
        },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(method_info_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).property_info_class as *const _ as usize
        },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(property_info_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).event_info_class as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(event_info_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).mono_event_info_class as *const _ as usize
        },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_event_info_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).stringbuilder_class as *const _ as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(stringbuilder_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).stack_frame_class as *const _ as usize
        },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(stack_frame_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).stack_trace_class as *const _ as usize
        },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(stack_trace_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).marshal_class as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(marshal_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).typed_reference_class as *const _ as usize
        },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(typed_reference_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).marshalbyrefobject_class as *const _ as usize
        },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(marshalbyrefobject_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).generic_ilist_class as *const _ as usize
        },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(generic_ilist_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).generic_icollection_class as *const _
                as usize
        },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(generic_icollection_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).generic_ienumerable_class as *const _
                as usize
        },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(generic_ienumerable_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).generic_ireadonlylist_class as *const _
                as usize
        },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(generic_ireadonlylist_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).generic_ireadonlycollection_class as *const _
                as usize
        },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(generic_ireadonlycollection_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).runtimetype_class as *const _ as usize
        },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(runtimetype_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).generic_nullable_class as *const _ as usize
        },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(generic_nullable_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).il2cpp_com_object_class as *const _ as usize
        },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(il2cpp_com_object_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).attribute_class as *const _ as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(attribute_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).customattribute_data_class as *const _
                as usize
        },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(customattribute_data_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).version as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).culture_info as *const _ as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(culture_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).async_call_class as *const _ as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(async_call_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).assembly_class as *const _ as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(assembly_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).mono_assembly_class as *const _ as usize
        },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_assembly_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).assembly_name_class as *const _ as usize
        },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(assembly_name_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).mono_field_class as *const _ as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_field_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).mono_method_class as *const _ as usize
        },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_method_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).mono_method_info_class as *const _ as usize
        },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_method_info_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).mono_property_info_class as *const _ as usize
        },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_property_info_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).parameter_info_class as *const _ as usize
        },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(parameter_info_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).mono_parameter_info_class as *const _
                as usize
        },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_parameter_info_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).module_class as *const _ as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(module_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).pointer_class as *const _ as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(pointer_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).system_exception_class as *const _ as usize
        },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(system_exception_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).argument_exception_class as *const _ as usize
        },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(argument_exception_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).wait_handle_class as *const _ as usize
        },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(wait_handle_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).safe_handle_class as *const _ as usize
        },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(safe_handle_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).sort_key_class as *const _ as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(sort_key_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).dbnull_class as *const _ as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(dbnull_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).error_wrapper_class as *const _ as usize
        },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(error_wrapper_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).missing_class as *const _ as usize },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(missing_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).value_type_class as *const _ as usize },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(value_type_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).threadpool_wait_callback_class as *const _
                as usize
        },
        632usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(threadpool_wait_callback_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).threadpool_perform_wait_callback_method
                as *const _ as usize
        },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(threadpool_perform_wait_callback_method)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).mono_method_message_class as *const _
                as usize
        },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_method_message_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).ireference_class as *const _ as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(ireference_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).ireferencearray_class as *const _ as usize
        },
        664usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(ireferencearray_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).ikey_value_pair_class as *const _ as usize
        },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(ikey_value_pair_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).key_value_pair_class as *const _ as usize
        },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(key_value_pair_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).windows_foundation_uri_class as *const _
                as usize
        },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(windows_foundation_uri_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).windows_foundation_iuri_runtime_class_class
                as *const _ as usize
        },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(windows_foundation_iuri_runtime_class_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).system_uri_class as *const _ as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(system_uri_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).system_guid_class as *const _ as usize
        },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(system_guid_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).sbyte_shared_enum as *const _ as usize
        },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(sbyte_shared_enum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).int16_shared_enum as *const _ as usize
        },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int16_shared_enum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).int32_shared_enum as *const _ as usize
        },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int32_shared_enum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).int64_shared_enum as *const _ as usize
        },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int64_shared_enum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppDefaults>())).byte_shared_enum as *const _ as usize },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(byte_shared_enum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).uint16_shared_enum as *const _ as usize
        },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint16_shared_enum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).uint32_shared_enum as *const _ as usize
        },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint32_shared_enum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppDefaults>())).uint64_shared_enum as *const _ as usize
        },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint64_shared_enum)
        )
    );
}
extern "C" {
    pub static mut il2cpp_defaults: Il2CppDefaults;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MemberInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CustomAttributesCache {
    pub count: ::std::os::raw::c_int,
    pub attributes: *mut *mut Il2CppObject,
}
#[test]
fn bindgen_test_layout_CustomAttributesCache() {
    assert_eq!(
        ::std::mem::size_of::<CustomAttributesCache>(),
        16usize,
        concat!("Size of: ", stringify!(CustomAttributesCache))
    );
    assert_eq!(
        ::std::mem::align_of::<CustomAttributesCache>(),
        8usize,
        concat!("Alignment of ", stringify!(CustomAttributesCache))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CustomAttributesCache>())).count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CustomAttributesCache),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CustomAttributesCache>())).attributes as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CustomAttributesCache),
            "::",
            stringify!(attributes)
        )
    );
}
pub type CustomAttributesCacheGenerator =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut CustomAttributesCache)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FieldInfo {
    pub name: *const ::std::os::raw::c_char,
    pub type_: *const Il2CppType,
    pub parent: *mut Il2CppClass,
    pub offset: i32,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_FieldInfo() {
    assert_eq!(
        ::std::mem::size_of::<FieldInfo>(),
        32usize,
        concat!("Size of: ", stringify!(FieldInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<FieldInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(FieldInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldInfo>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldInfo>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldInfo>())).parent as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldInfo),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldInfo>())).offset as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldInfo),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldInfo>())).token as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldInfo),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PropertyInfo {
    pub parent: *mut Il2CppClass,
    pub name: *const ::std::os::raw::c_char,
    pub get: *const MethodInfo,
    pub set: *const MethodInfo,
    pub attrs: u32,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_PropertyInfo() {
    assert_eq!(
        ::std::mem::size_of::<PropertyInfo>(),
        40usize,
        concat!("Size of: ", stringify!(PropertyInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<PropertyInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(PropertyInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PropertyInfo>())).parent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PropertyInfo),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PropertyInfo>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PropertyInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PropertyInfo>())).get as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PropertyInfo),
            "::",
            stringify!(get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PropertyInfo>())).set as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PropertyInfo),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PropertyInfo>())).attrs as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PropertyInfo),
            "::",
            stringify!(attrs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PropertyInfo>())).token as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(PropertyInfo),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EventInfo {
    pub name: *const ::std::os::raw::c_char,
    pub eventType: *const Il2CppType,
    pub parent: *mut Il2CppClass,
    pub add: *const MethodInfo,
    pub remove: *const MethodInfo,
    pub raise: *const MethodInfo,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_EventInfo() {
    assert_eq!(
        ::std::mem::size_of::<EventInfo>(),
        56usize,
        concat!("Size of: ", stringify!(EventInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<EventInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(EventInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EventInfo>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EventInfo>())).eventType as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EventInfo>())).parent as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EventInfo>())).add as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(add)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EventInfo>())).remove as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(remove)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EventInfo>())).raise as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(raise)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EventInfo>())).token as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ParameterInfo {
    pub name: *const ::std::os::raw::c_char,
    pub position: i32,
    pub token: u32,
    pub parameter_type: *const Il2CppType,
}
#[test]
fn bindgen_test_layout_ParameterInfo() {
    assert_eq!(
        ::std::mem::size_of::<ParameterInfo>(),
        24usize,
        concat!("Size of: ", stringify!(ParameterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<ParameterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(ParameterInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ParameterInfo>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ParameterInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ParameterInfo>())).position as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ParameterInfo),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ParameterInfo>())).token as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ParameterInfo),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ParameterInfo>())).parameter_type as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ParameterInfo),
            "::",
            stringify!(parameter_type)
        )
    );
}
pub type InvokerMethod = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: Il2CppMethodPointer,
        arg2: *const MethodInfo,
        arg3: *mut ::std::os::raw::c_void,
        arg4: *mut *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub const MethodVariableKind_kMethodVariableKind_This: MethodVariableKind = 0;
pub const MethodVariableKind_kMethodVariableKind_Parameter: MethodVariableKind = 1;
pub const MethodVariableKind_kMethodVariableKind_LocalVariable: MethodVariableKind = 2;
pub type MethodVariableKind = ::std::os::raw::c_uint;
pub const SequencePointKind_kSequencePointKind_Normal: SequencePointKind = 0;
pub const SequencePointKind_kSequencePointKind_StepOut: SequencePointKind = 1;
pub type SequencePointKind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodExecutionContextInfo {
    pub typeIndex: TypeIndex,
    pub nameIndex: i32,
    pub scopeIndex: i32,
}
#[test]
fn bindgen_test_layout_Il2CppMethodExecutionContextInfo() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodExecutionContextInfo>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppMethodExecutionContextInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodExecutionContextInfo>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppMethodExecutionContextInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodExecutionContextInfo>())).typeIndex as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodExecutionContextInfo),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodExecutionContextInfo>())).nameIndex as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodExecutionContextInfo),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodExecutionContextInfo>())).scopeIndex as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodExecutionContextInfo),
            "::",
            stringify!(scopeIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodExecutionContextInfoIndex {
    pub startIndex: i32,
    pub count: i32,
}
#[test]
fn bindgen_test_layout_Il2CppMethodExecutionContextInfoIndex() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodExecutionContextInfoIndex>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppMethodExecutionContextInfoIndex)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodExecutionContextInfoIndex>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppMethodExecutionContextInfoIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodExecutionContextInfoIndex>())).startIndex as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodExecutionContextInfoIndex),
            "::",
            stringify!(startIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Il2CppMethodExecutionContextInfoIndex>())).count as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodExecutionContextInfoIndex),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodScope {
    pub startOffset: i32,
    pub endOffset: i32,
}
#[test]
fn bindgen_test_layout_Il2CppMethodScope() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodScope>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppMethodScope))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodScope>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppMethodScope))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppMethodScope>())).startOffset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodScope),
            "::",
            stringify!(startOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Il2CppMethodScope>())).endOffset as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodScope),
            "::",
            stringify!(endOffset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodHeaderInfo {
    pub code_size: i32,
    pub startScope: i32,
    pub numScopes: i32,
}
#[test]
fn bindgen_test_layout_Il2CppMethodHeaderInfo() {
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodHeaderInfo>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppMethodHeaderInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodHeaderInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppMethodHeaderInfo))
    );
    assert_eq!(
        unsafe {
